/*************** (C) COPYRIGHT 2012 Kingrobot manipulator Team ****************
* File Name          : I2CInt.c
* Author             : Fenkella Zhou
* Version            : V1.0.0
* Date               : 05/06/2012
* Description        : This file is complete the I2C settings.
******************************************************************************/

#include "stm32f10x_lib.h"		
#include "i2cint.h"
#include "Delay.h"

/**************************************************************************************************
**  函数名：  I2CInit()
**	输入参数：无
**	输出参数：无
**	函数功能：配置模拟I2C
**	备注：	  由于针对25C512芯片，硬件I2C无法实现，
**            采用罗立峰调通的模拟I2C方式
**  作者：    周海波    
**  开发日期：2012/7/3
***************************************************************************************************/
void I2CInit(void)
{					     
 	RCC->APB2ENR |= 1<<4;//先使能外设IO PORTC时钟 							 
	GPIOB->CRL &= 0X00FFFFFF;
	GPIOB->CRL |= 0X33000000;	   
	GPIOB->ODR |= 3<<11;     
}

/**************************************************************************************************
**  函数名：  I2CStart()
**	输入参数：无
**	输出参数：无
**	函数功能：参数I2C起始信号
**	备注：	  无
**  作者：    周海波    
**  开发日期：2012/7/3
***************************************************************************************************/
void I2CStart(void)
{
    SDA_OUT();     //sda线输出
	I2C_SDA = 1;	  	  
	I2C_SCL = 1;
	DelayNus(4);
 	I2C_SDA = 0;//START:when CLK is high,DATA change form high to low 
	DelayNus(4);
	I2C_SCL = 0;//钳住I2C总线，准备发送或接收数据 
}	
  
/**************************************************************************************************
**  函数名：  I2CStop()
**	输入参数：无
**	输出参数：无
**	函数功能：参数I2C停止信号
**	备注：	  无
**  作者：    周海波    
**  开发日期：2012/7/3
***************************************************************************************************/
void I2CStop(void)
{
	SDA_OUT();//sda线输出
	I2C_SCL = 0;
	I2C_SDA = 0;//STOP:when CLK is high DATA change form low to high
 	DelayNus(4);
	I2C_SCL = 1; 
	I2C_SDA = 1;//发送I2C总线结束信号
	DelayNus(4);							   	
}

/**************************************************************************************************
**  函数名：  I2CWaitAck()
**	输入参数：无
**	输出参数：u8 （0/1） 1：接收应答失败；0：接收应答成功
**	函数功能：等待应答信号
**	备注：	  无
**  作者：    周海波    
**  开发日期：2012/7/3
***************************************************************************************************/
u8 I2CWaitAck(void)
{
	u8 ucErrTime = 0;

	SDA_IN();      			//SDA设置为输入  
	I2C_SDA = 1;
	DelayNus(1);	   
	I2C_SCL = 1;
	DelayNus(1);
		 
	while(READ_SDA)
	{
		ucErrTime++;
		if(ucErrTime > 250)
		{
			I2CStop();
			return 1;
		}
	}
	I2C_SCL = 0;				//时钟输出0 	   
	return 0;  
} 

/**************************************************************************************************
**  函数名：  I2CAck()
**	输入参数：无
**	输出参数：无
**	函数功能：产生应答信号
**	备注：	  无
**  作者：    周海波    
**  开发日期：2012/7/3
***************************************************************************************************/
void I2CAck(void)
{
	I2C_SCL = 0;
	SDA_OUT();
	I2C_SDA = 0;
	DelayNus(2);
	I2C_SCL = 1;
	DelayNus(2);
	I2C_SCL = 0;
}

/**************************************************************************************************
**  函数名：  I2CNAck()
**	输入参数：无
**	输出参数：无
**	函数功能：不产生应答信号
**	备注：	  无
**  作者：    周海波    
**  开发日期：2012/7/3
***************************************************************************************************/
void I2CNAck(void)
{
	I2C_SCL = 0;
	SDA_OUT();
	I2C_SDA = 1;
	DelayNus(2);
	I2C_SCL = 1;
	DelayNus(2);
	I2C_SCL = 0;
}					 				     

/**************************************************************************************************
**  函数名：  I2CSendByte()
**	输入参数：需要发送的数据
**	输出参数：无
**	函数功能：发送一个字节数据
**	备注：	  无
**  作者：    周海波    
**  开发日期：2012/7/3
***************************************************************************************************/		  
void I2CSendByte(u8 txd)
{                        
    u8 t;   
	SDA_OUT(); 	    
    I2C_SCL = 0;//拉低时钟开始数据传输
    for(t = 0;t < 8;t++)
    {              
        I2C_SDA=(txd&0x80) >> 7;
        txd <<= 1; 	  
		DelayNus(2);   //对TEA5767这三个延时都是必须的
		I2C_SCL = 1;
		DelayNus(2); 
		I2C_SCL = 0;	
		DelayNus(2);
    }	 
}

/**************************************************************************************************
**  函数名：  I2CReadByte()
**	输入参数：是否需要发送应答
**	输出参数：读取得到的数据
**	函数功能：读取一个字节数据
**	备注：	  无
**  作者：    周海波    
**  开发日期：2012/7/3
***************************************************************************************************/		    
u8 I2CReadByte(unsigned char ack)
{
	u8 i = 0;
	u8 receive = 0;

	SDA_IN();//SDA设置为输入
    for(i = 0;i< 8;i++ )
	{
        I2C_SCL = 0; 
        DelayNus(2);
		I2C_SCL = 1;
        receive <<= 1;
        if(READ_SDA)receive++;   
		DelayNus(1); 
    }					 
    if (!ack)
	{
        I2CNAck();//发送nACK
	}
    else
	{
        I2CAck(); //发送ACK 
	}  
    return receive;
}

/******************* (C) COPYRIGHT 2012 Kingrobot manipulator Team *****END OF FILE****/
